import React, { Component } from 'react'

export default class extends Component {
  render() {
    return (
      <div>
        <p>使用者授权条款</p>
        <p>本授权条款（以下称本条款）为纬创资通股份有限公司(授权人，以下称本公司)所提供本软体(包括本软体之更新程式、增补程式、网际网路服务与支援服务)的使用条件，只有在您(个人或您所代表的实体，以下简称「贵用户」）遵守本条款规定之前提下，本公司将授予 贵用户取得合法、有限的、不可转让的、不可再授权的且非独占性使用本软体的有限权利。</p>
        <p><strong>本软体一经安装或使用，即代表 贵用户接受本条款。如 贵用户不同意本条款之任一部份，请勿安装或使用本软体全部或任何部份。</strong></p>
        <p>&nbsp;</p>
        <p><strong>一、授权限制</strong></p>
        <p>本条款所授予的有限权利系以 贵用户遵守以下限制为条件， 贵用户不得进行下列任何行为：</p>
        <ol>
          <li>突破本软体的技术限制、使用本软体或与任何设备、专案或服务配合，试图规避用于控制档或其他资料获取或权利的技术手段；</li>
          <li>对本软体进行反向开发、反编译、解密、反汇编或以其他方式试图获得本软体的原始程式码，但就使用开放性源代码(open source code) 而其授权条款允许之部分以及适用法律明文允许或禁止此种限制者，不在此限；</li>
          <li>对本软体进行复制、散布、出售、出租、出借、设定担保权益或转让本软体及基於本条款对本软体所得享有的权利授予他人；</li>
          <li>分发、转让、披露或以其他方式向任何第三人提供本软体；</li>
          <li>对本软体进行全部或部分修改、再编译、解译或创作衍生作品，但就使用开放性源代码(open source code)且其授权条款允许得修改、再编译、解译或创作之部分则不在此限；</li>
          <li>移除、变更或遮蔽本软体或任何副本上的任何专有权声明或标签；</li>
          <li>提供本软体作为第三人商业服务之用途；</li>
          <li>使用本软体侵犯本公司、本公司关系企业或任何第三人的权利或者违反任何适用法律的规定；</li>
          <li>以本条款禁止的方式使用本软体。</li>
        </ol>
        <p>&nbsp;</p>
        <p><strong>二、权利和所有权保留</strong></p>
        <p>本公司、本公司关系企业和经销商拥有本软体的所有权、版权和其他智慧财产权，包括但不限於著作权、营业祕密、专利权和商标权等，并保留所有在本条款中未明确向 贵用户授予的权利。本软体受国际著作权条约以及其他智慧财产权之法律及国际间著作权相互保障条约之保护。</p>
        <p>&nbsp;</p>
        <p><strong>三、有限保证</strong></p>
        <p>除本条款有明示保证以外，在适用法律所允许的最大范围内，本软体系「按现况」提供(AS IS), 本公司、本公司关系企业和经销商在此不作出任何明示或默示或法定的其他保证和条件，包括但不限於不中断服务、商业适合性、特定目的之适用性、安全等相关缺陷、程式错误或无侵权之默示保证、责任或条件。</p>
        <p>&nbsp;</p>
        <p><strong>四、责任限制</strong></p>
        <ol>
          <li>免责声明：因使用或执行本软体而产生之结果、效能均应由 贵用户承担全部风险。在适用法律所允许的最大范围内，本公司、本公司关系企业和经销商不就因使用或不能使用本软体所引起的或有关的任何间接的、意外的、直接的、非直接的、特殊的、惩罚性的或其他任何损害(包括但不限於营业利润之损失、业务中断、商业资讯之损失或其他金钱损失)承担赔偿责任，即使本公司、本公司关系企业和经销商事先被告知该损害发生的可能性。</li>
          <li>直接损失：在适用法律所允许的最大范围内，本公司、本公司关系企业和经销商对依法不得免责的任何情况下直接的财产或个人损失的总赔偿额（无论是一起事件还是一系列事件）都不超过 贵用户为导致此索赔的本软体所支付金额。上述免除和限制不适用于与死亡或人身伤害有关的索赔。</li>
        </ol>
        <p>贵用户如有违反前开所列条件，本软体相关一切使用权利将自动终止， 贵用户除须立即移除且不得再使用本软体外，且须就因违反本条款而引起或相关的请求、诉讼或法律行动 (包括承担所有因请求、损失、损害、诉讼、判决、诉讼费用和律师费用而产生的任何责任或费用)负责，并应赔偿本公司因此所受之损害。</p>
        <p><strong>&nbsp;</strong></p>
        <p><strong>五、</strong><strong>準据法、管辖法院</strong></p>
        <p>本条款以中华民国法律为準据法，并排除其涉外民事法律适用法之适用。贵用户与本公司间所发生起因於本软体或与本条款有关连的纷争，以台湾台北地方法院为双方合意的第一审管辖法院。</p>
        <p>&nbsp;</p>
        <p>&nbsp;</p>
        <p>最后更新日期：2015年03月06日</p>
      </div>
    )
  }
}
