import React, { Component } from 'react'

export default class extends Component {
  render() {
    return (
      <div>
        <p>使用者授權條款</p>
        <p>本授權條款（以下稱本條款）為緯創資通股份有限公司(授權人，以下稱本公司)所提供本軟體(包括本軟體之更新程式、增補程式、網際網路服務與支援服務)的使用條件，只有在您(個人或您所代表的實體，以下簡稱「貴用戶」）遵守本條款規定之前提下，本公司將授予 貴用戶取得合法、有限的、不可轉讓的、不可再授權的且非獨占性使用本軟體的有限權利。</p>
        <p><strong>本軟體一經安裝或使用，即代表 貴用戶接受本條款。如 貴用戶不同意本條款之任一部份，請勿安裝或使用本軟體全部或任何部份。</strong></p>
        <p>&nbsp;</p>
        <p><strong>一、授權限制</strong></p>
        <p>本條款所授予的有限權利係以 貴用戶遵守以下限制為條件， 貴用戶不得進行下列任何行為：</p>
        <ol>
        <li>突破本軟體的技術限制、使用本軟體或與任何設備、專案或服務配合，試圖規避用於控制檔或其他資料獲取或權利的技術手段；</li>
        <li>對本軟體進行反向開發、反編譯、解密、反彙編或以其他方式試圖獲得本軟體的原始程式碼，但就使用開放性原始碼(open source code) 而其授權條款允許之部分以及適用法律明文允許或禁止此種限制者，不在此限；</li>
        <li>對本軟體進行複製、散佈、出售、出租、出借、設定擔保權益或轉讓本軟體及基於本條款對本軟體所得享有的權利授予他人；</li>
        <li>分發、轉讓、披露或以其他方式向任何第三人提供本軟體；</li>
        <li>對本軟體進行全部或部分修改、再編譯、解譯或創作衍生作品，但就使用開放性原始碼(open source code)且其授權條款允許得修改、再編譯、解譯或創作之部分則不在此限；</li>
        <li>移除、變更或遮蔽本軟體或任何副本上的任何專有權聲明或標籤；</li>
        <li>提供本軟體作為第三人商業服務之用途；</li>
        <li>使用本軟體侵犯本公司、本公司關係企業或任何第三人的權利或者違反任何適用法律的規定；</li>
        <li>以本條款禁止的方式使用本軟體。</li>
        </ol>
        <p>&nbsp;</p>
        <p><strong>二、權利和所有權保留</strong></p>
        <p>本公司、本公司關係企業和經銷商擁有本軟體的所有權、版權和其他智慧財產權，包括但不限於著作權、營業祕密、專利權和商標權等，並保留所有在本條款中未明確向 貴用戶授予的權利。本軟體受國際著作權條約以及其他智慧財產權之法律及國際間著作權相互保障條約之保護。</p>
        <p>&nbsp;</p>
        <p><strong>三、有限保證</strong></p>
        <p>除本條款有明示保證以外，在適用法律所允許的最大範圍內，本軟體係「按現況」提供(AS IS), 本公司、本公司關係企業和經銷商在此不作出任何明示或默示或法定的其他保證和條件，包括但不限於不中斷服務、商業適合性、特定目的之適用性、安全等相關缺陷、程式錯誤或無侵權之默示保證、責任或條件。</p>
        <p>&nbsp;</p>
        <p><strong>四、責任限制</strong></p>
        <ol>
        <li>免責聲明：因使用或執行本軟體而產生之結果、效能均應由 貴用戶承擔全部風險。在適用法律所允許的最大範圍內，本公司、本公司關係企業和經銷商不就因使用或不能使用本軟體所引起的或有關的任何間接的、意外的、直接的、非直接的、特殊的、懲罰性的或其他任何損害(包括但不限於營業利潤之損失、業務中斷、商業資訊之損失或其他金錢損失)承擔賠償責任，即使本公司、本公司關係企業和經銷商事先被告知該損害發生的可能性。</li>
        <li>直接損失：在適用法律所允許的最大範圍內，本公司、本公司關係企業和經銷商對依法不得免責的任何情況下直接的財產或個人損失的總賠償額（無論是一起事件還是一系列事件）都不超過 貴用戶為導致此索賠的本軟體所支付金額。上述免除和限制不適用於與死亡或人身傷害有關的索賠。</li>
        </ol>
        <p>貴用戶如有違反前開所列條件，本軟體相關一切使用權利將自動終止， 貴用戶除須立即移除且不得再使用本軟體外，且須就因違反本條款而引起或相關的請求、訴訟或法律行動 (包括承擔所有因請求、損失、損害、訴訟、判決、訴訟費用和律師費用而產生的任何責任或費用)負責，並應賠償本公司因此所受之損害。</p>
        <p><strong>&nbsp;</strong></p>
        <p><strong>五、</strong><strong>準據法、管轄法院</strong></p>
        <p>本條款以中華民國法律為準據法，並排除其涉外民事法律適用法之適用。貴用戶與本公司間所發生起因於本軟體或與本條款有關連的紛爭，以臺灣臺北地方法院為雙方合意的第一審管轄法院。</p>
        <p>&nbsp;</p>
        <p>&nbsp;</p>
        <p>最後更新日期：2015年03月06日</p>
      </div>
    )
  }
}
